module.exports = {
	"rooms": {
		"default": {
			"display": "默认",
			"table": "room_default", // 数据表
			"connectpassword": "123456", // 客户端连接密码
			"managepassword": "123456", // 管理密码
			"advancedpassword": "123456", // 高级弹幕密码
			"keyword": {
				"block": "我.*爱.*你|我.*喜.*欢.*你|嫁|在.*一.*起|娶|啪.*啪.*啪|性.*交|(大|肉|小|贫|丰|巨|胸|乳).*(胸|罩|乳|房|棒)|f.*u.*c.*k|b.*i.*t.*c.*h|傻|残|垃.*圾|(大|小).*便|屎|滚|逼|屄|叼|屌|草.*泥.*马|陪.*侍|女.*友|阴.*茎|睾.*丸|附.*睾|阴.*囊|前.*列.*腺|精.*液|尿.*道|精.*囊|阴.*蒂|阴.*道|阴.*唇|子.*宫|输.*卵|卵.*巢|(前|后).*庭|(推.*广|群.*发|广.*告|解.*密|赌.*博|包.*青.*天|阿.*凡.*提|发.*贴|顶.*贴|(针.*孔|隐.*形|隐.*蔽).*摄.*像|干.*扰|顶.*帖|发.*帖|消.*声|遥.*控|解.*码|窃.*听|身份.*证.*生.*成|拦.*截|复.*制|监.*听|定.*位|消.*声|作.*弊|扩.*散|侦.*探|追.*杀).*(机|器|软.*件|设.*备|系.*统)|(求|换|有.*偿|买|卖|出.*售).*(肾|器.*官|眼.*角.*膜|血)|肾.*源|(假|毕.*业).*(证|文.*凭|发.*票|币)|(手.*榴|人|麻.*醉|霰).*弹|治.*疗(肿.*瘤|乙.*肝|性.*病|红.*斑.*狼.*疮)|重亚硒酸钠|(粘氯|原砷)酸|麻醉乙醚|原藜芦碱A|永伏虫|蝇毒|罂粟|银氰化钾|氯胺酮|因毒(硫磷|磷)|异氰酸(甲酯|苯酯)|异硫氰酸烯丙酯|乙酰(亚砷酸铜|替硫脲)|乙烯甲醇|乙酸(亚铊|铊|三乙基锡|三甲基锡|甲氧基乙基汞|汞)|乙硼烷|乙醇腈|乙撑亚胺|乙撑氯醇|伊皮恩|海.*洛.*因|一氧(化汞|化二氟)|一氯(乙醛|丙酮)|氧氯化磷|氧化(亚铊|铊|汞|二丁基锡)|烟碱|亚硝酰乙氧|亚硝酸乙酯|亚硒酸氢钠|亚硒酸钠|亚硒酸镁|亚硒酸二钠|亚硒酸|亚砷酸(钠|钾|酐)|冰.*毒|摇.*头.*丸|预.*测.*答.*案|考.*前.*预.*测|押.*题|代.*写.*论.*文|(提.*供|司.*考|级|传.*送|考.*中|短.*信)答.*案|(待|代|带|替|助).*考|(包|顺.*利|保)过|考.*后.*付.*款|作.*弊|考.*前.*密.*卷|漏.*题|中.*特|一.*肖|报.*码|(合|香.*港).*彩|彩.*宝|3D轮盘|liuhecai|一.*码|(皇家|俄罗斯).*轮盘|赌.*具|特码|盗取?.*(号|qq|密码)|嗑.*药|帮.*招.*人|社.*会.*混|拜.*大.*哥|电.*警.*棒|帮.*人.*怀.*孕|切.*腹|电.*鸡|手.*枪|炸.*弹|走.*私|陪.*聊|h.*(图|漫|网)|开.*苞|找.*(男|女)|(口|足|胸|乳).*(淫|交|推)|后入式|卖.*身|一.*夜|(男|女).*奴|双.*(筒|桶)|看.*J.*J|(做|坐).*台|厕.*奴|骚.*女|嫩.*逼|一.*夜.*激.*情|乱.*伦|泡.*友|富.*(姐|婆)|(足|群|茹).*交|阴.*户|性.*(服.*务|伴.*侣|伙.*伴|交)|(有|无).*码|包.*养|(犬|兽|幼).*交|根.*浴|援.*交|性.*(虐|爱|息)|刻.*章|昏.*药|性奴.*|透.*视.*眼(睛|镜)|拍.*肩.*神|(失.*忆|催.*情|迷.*(幻|昏|奸)?|安.*定)(药|片|香)|香.*港.*生.*子|土.*炮|胎.*盘|手.*机.*魔.*卡|容.*弹.*量|枪.*模|铅.*弹|汽.*(枪|狗|走.*表.*器)|气.*枪|气.*狗|伟.*哥|纽.*扣.*摄.*像.*机|免.*电.*灯|麻.*醉.*药|康.*生.*丹|警.*徽|记.*号.*扑.*克|激.*光.*(汽|气)|红.*床|狗.*友|电.*子.*狗.*导.*航.*手.*机|弹.*(种|夹)|(追|讨)债|避.*孕|办.*理.*(证.*件|文.*凭)|斑.*蝥|暗.*访.*包|B.*B.*(枪|弹)|雷.*管|弓.*弩|(电|长)狗|导.*爆.*索|爆.*炸.*物|爆.*破|左.*棍|婊.*子|换.*妻|成.*人.*片|淫.*(靡|水|兽)|阴.*(毛|蒂|道|唇)|小.*穴|缩.*阴|少.*妇.*自.*拍|(三.*级|色.*情|激.*情|黄.*色|小)(片|电.*影|视.*频|交.*友|电.*话)|肉.*棒|(情|奸)杀|裸.*照|乱.*伦|口.*交|禁.*(网|片)|春.*宫.*图|S.*M.*用.*品|自.*动.*群.*发|私.*家.*侦.*探.*服.*务|生.*意.*宝|商.*务.*(快.*车|短.*信)|慧.*聪|供.*应.*发.*票|发.*票.*代.*开|短.*信.*群.*发|短.*信.*猫|点.*金.*商.*务|士.*的.*宁|士.*的.*年|六.*合.*(采|彩)|乐.*透.*码|彩.*票|百.*乐.*二.*呓|百.*家.*乐|黄.*页|出.*租|求.*购|留.*学.*咨.*询|外.*挂|网.*络.*(兼.*职|赚.*钱)|(证.*件|婚.*庆|翻.*译|搬.*家|追.*债|债.*务)公.*司|手.*机.*(游.*戏|窃.*听|监.*听|铃.*声|图.*片)|三.*唑.*仑|彩.*(信|铃|票)|显.*示.*屏|投.*影.*仪|虚.*拟.*主.*机|(域.*名|专.*业)注.*册|营.*销|性.*病|不.*孕.*不.*育|乳.*腺.*病|尖.*锐.*湿.*疣|皮.*肤.*病|减.*肥|瘦|3.*P|人.*兽|代.*孕|打.*炮|找.*小.*姐|刻.*章|乱.*伦|中.*出|楼.*凤|卖.*淫|荡.*妇|群.*交|幼.*女|1.*8.*禁|伦.*理.*电.*影|(催.*情|蒙.*汗|蒙.*汉|春)药|情.*趣.*用.*品|成.*人.*.+?.*(电.*影|用.*品)|激.*情.*(视.*频|电.*影|影.*院)|爽.*片|美.*女|交.*友|怀.*孕|裸.*聊|制.*服.*诱.*惑|丝.*袜|长.*腿|寂.*寞.*女.*子|双.*色.*球|福.*彩|体.*彩|6.*合.*彩|时.*时.*彩|双.*色.*球|咨.*询.*热.*线|股.*票|荐.*股|开.*股|私.*服|枪|警.*棒|警.*服|麻.*醉|诚.*招.*加.*盟|诚.*信.*经.*营|杀.*手|(游.*戏|金)币|群.*发|加.*盟|名.*表|特.*卖|分.*销",
				"replacement": "父|母|夫|妻|女儿|儿子|孙子|孙女|女婿|娘|爹|爸|妈|爷|奶|哥|弟|兄|姐|妹|鸡|鸭|狗|猪|mother|mom|father|dad|sister|brother|son|daughter|dog|pig" // 替换关键词
			},
			"blockusers": [ // 封禁用户
				"test"
			],
			"maxlength": 100, // 队列最大长度
			"openstate": true // 房间开关
		}
	},
	"database": {
		"type": "mysql", // 数据库类型
		"server": "127.0.0.1", // 数据库地址
		"username": "root", // 数据库用户名
		"password": "123456", // 数据库密码
		"port": "3306", // 数据库端口
		"db": "danmu", // 数据库
	},
	"websocket": {
		"interval": 10, // 弹幕发送间隔
		"singlesize": 5 // 每次弹幕发送数量
	},
	"http": {
		"port": 3000, // 服务器端口
		"headers": { // HTTP头
			"Access-Control-Allow-Origin": "*",
			"Access-Control-Allow-Methods": "POST"
		}
	},
	"env": {
		"childprocess": false, // 多进程（child_process），好像没什么用
		"log": false // 日志开关
	}
}