module.exports = {
	"rooms": {
		"default": {
			"display": "默认",
			"table": "room_default", // 数据表
			"connectpassword": "123456", // 客户端连接密码
			"managepassword": "123456", // 管理密码
			"advancedpassword": "123456", // 高级弹幕密码
			"keyword": {
				"block": /宣你|阳痿|臭脚|难听|难看|法克|木耳|纵欲|dick|爽|下流|非礼|煞笔|傻比|沙比|蠢|丁丁|抠脚|奸|粑|EXO|TFBoys|王源|王俊凯|易烊千玺|吴亦凡|鹿晗|Love|土狗|我爱|爱你|我喜欢|喜欢你|嫁|在一起|娶|啪啪啪|性交|(大|肉|小|贫|丰|巨|胸|乳)(胸|罩|乳|房|棒)|fuck|bitch|傻|残|垃圾|(大|小)便|屎|滚|逼|屄|叼|屌|草泥马|陪侍|女友|阴茎|睾丸|附睾|阴囊|前列腺|精液|尿道|精囊|阴蒂|阴道|阴唇|子宫|输卵|卵巢|(前|后)庭|(推广|群发|广告|解密|赌博|包青天|阿凡提|发贴|顶贴|(针孔|隐形|隐蔽)摄像|干扰|顶帖|发帖|消声|遥控|解码|窃听|身份证生成|拦截|复制|监听|定位|消声|作弊|扩散|侦探|追杀)(机|器|软件|设备|系统)|(求|换|有偿|买|卖|出售)(肾|器官|眼角膜|血)|肾源|(假|毕业)(证|文凭|发票|币)|(手榴|人|麻醉|霰)弹|治疗(肿瘤|乙肝|性病|红斑狼疮)|重亚硒酸钠|(粘氯|原砷)酸|麻醉乙醚|原藜芦碱A|永伏虫|蝇毒|罂粟|银氰化钾|氯胺酮|因毒(硫磷|磷)|异氰酸(甲酯|苯酯)|异硫氰酸烯丙酯|乙酰(亚砷酸铜|替硫脲)|乙烯甲醇|乙酸(亚铊|铊|三乙基锡|三甲基锡|甲氧基乙基汞|汞)|乙硼烷|乙醇腈|乙撑亚胺|乙撑氯醇|伊皮恩|海洛因|一氧(化汞|化二氟)|一氯(乙醛|丙酮)|氧氯化磷|氧化(亚铊|铊|汞|二丁基锡)|烟碱|亚硝酰乙氧|亚硝酸乙酯|亚硒酸氢钠|亚硒酸钠|亚硒酸镁|亚硒酸二钠|亚硒酸|亚砷酸(钠|钾|酐)|冰毒|摇头丸|预测答案|考前预测|押题|代写论文|(提供|司考|级|传送|考中|短信)答案|(待|代|带|替|助)考|(包|顺利|保)过|考后付款|作弊|考前密卷|漏题|中特|一肖|报码|(合|香港)彩|彩宝|3D轮盘|liuhecai|一码|(皇家|俄罗斯)轮盘|赌具|特码|盗取?(号|qq|密码)|嗑药|帮招人|社会混|拜大哥|电警棒|帮人怀孕|切腹|电鸡|手枪|炸弹|走私|陪聊|h(图|漫|网)|开苞|找(男|女)|(口|足|胸|乳)(淫|交|推)|后入式|卖身|一夜|(男|女)奴|双(筒|桶)|看JJ|(做|坐)台|厕奴|骚女|嫩逼|一夜激情|乱伦|泡友|富(姐|婆)|(足|群|茹)交|阴户|性(服务|伴侣|伙伴|交)|(有|无)码|包养|(犬|兽|幼)交|根浴|援交|性(虐|爱|息)|刻章|昏药|性奴|透视眼(睛|镜)|拍肩神|(失忆|催情|迷(幻|昏|奸)?|安定)(药|片|香)|香港生子|土炮|胎盘|手机魔卡|容弹量|枪模|铅弹|汽(枪|狗|走表器)|气枪|气狗|伟哥|纽扣摄像机|免电灯|麻醉药|康生丹|警徽|记号扑克|激光(汽|气)|红床|狗友|电子狗导航手机|弹(种|夹)|(追|讨)债|避孕|办理(证件|文凭)|斑蝥|暗访包|BB(枪|弹)|雷管|弓弩|(电|长)狗|导爆索|爆炸物|爆破|左棍|婊子|换妻|成人片|淫(靡|水|兽)|阴(毛|蒂|道|唇)|小穴|缩阴|少妇自拍|(三级|色情|激情|黄色|小)(片|电影|视频|交友|电话)|肉棒|(情|奸)杀|裸照|乱伦|口交|禁(网|片)|春宫图|SM用品|自动群发|私家侦探服务|生意宝|商务(快车|短信)|慧聪|供应发票|发票代开|短信群发|短信猫|点金商务|士的宁|士的年|六合(采|彩)|乐透码|彩票|百乐二呓|百家乐|黄页|出租|求购|留学咨询|外挂|网络(兼职|赚钱)|(证件|婚庆|翻译|搬家|追债|债务)公司|手机(游戏|窃听|监听|铃声|图片)|三唑仑|彩(信|铃|票)|显示屏|投影仪|虚拟主机|(域名|专业)注册|营销|性病|不孕不育|乳腺病|尖锐湿疣|皮肤病|减肥|瘦|3P|人兽|代孕|打炮|找小姐|刻章|乱伦|中出|楼凤|卖淫|荡妇|群交|幼女|18禁|伦理电影|(催情|蒙汗|蒙汉|春)药|情趣用品|成人.+?(电影|用品)|激情(视频|电影|影院)|爽片|美女|交友|怀孕|裸聊|制服诱惑|丝袜|长腿|寂寞女子|双色球|福彩|体彩|6合彩|时时彩|双色球|咨询热线|股票|荐股|开股|私服|枪|警棒|警服|麻醉|诚招加盟|诚信经营|杀手|(游戏|金)币|群发|加盟|名表|特卖|分销|残党|共惨党|共匪|赤匪|裆中央|北京当局|中宣|真理部|十八大|18大|太子|上海帮|团派|九常委|九长老|政治局常委内幕|锦涛|hujin|家宝|影帝|wenjiabao|wjb|近平|xijinping|xjp|假庆淋|jiaqinglin|李月月鳥|李鹏|回良玉|汪洋|岐山|王山支山|wangqishan张高丽|俞正声|徐才厚|郭伯雄|梁光烈|孟建柱|戴秉国|马凯|计划|韩正|章沁生|陈世炬|泽民|贼民|先皇|太上皇|蛤蟆|驾崩|jiangzemin|jzm|邓小平|庆红|罗干|likeqiang|zhouyongkang|lichangchun|wubangguo|heguoqiang|老人政治|老人干政|陈光诚事件|自由光诚|陈光诚.*使馆|使馆.*陈光诚|光诚.*沂南|沂南.*光诚|要有光.*要有诚|要有诚.*要有光|马驰.*新加坡|职称英语.*答案|答案.*职称英语|公务员.*答案|答案.*公务员|重庆|熙来|薄督|不厚|薄瓜瓜|谷开来|海伍德|尼尔伍德|heywood|neil.*wood|wood.*neil|天线宝宝.*康师傅|康师傅.*天线宝宝|天线宝宝.*方便面|方便面.*天线宝宝|政变|暴动|枪声|戒严|3\.19|北京事件|北京.*出事了|出事了.*北京|北京怎么了|叶城.*砍杀|砍杀.*叶城|弟弟.*睡|睡.*弟弟|山水文园|跑官|移动.*十年兴衰|十年兴衰.*移动|叶兵|张斌|陈瑞卿|高念书|华如秀|鲁向东|曲乃杰|孙静晔|涂志森|于剑鸣|张晓明|赵志强|郑建源|丘小雄|公诉|右派|增城|莫日根|内蒙古.*抗议|抗议.*内蒙古|西乌旗|天府|人民公园|埃及|突尼斯|茉莉|jasmine.*revolution|revolution.*jasmine|moli|集会|公开信|六四|六 四|六\.四|64|天安门|八九|平反64|六月四日|5月35日|5月35号|89动乱|64memo|tiananmen|8964|天安.*事件|事件.*天安|1989.*天安門|天安門.*1989|开枪|广场|1989年|198964﻿|89.*学生动乱|学生动乱.*89|89.*学生运动|学生运动.*89|64.*学生运动|学生运动.*64|64.*镇压|镇压.*64|64.*真相|真相.*64|学潮|罢课|民运|学运|学联|学自联|高自联|工自联|坦克人|挡坦克|tankman|木犀地|维园晚会|blood is on the square|耀邦|紫阳|改革.*历程|历程.*改革|国家的囚徒|prisoner of the state|民联|民阵|中国民主党|中国民主正义党|中国民主运动|世纪中国基金会|姜维平|艾未未|艾末末|路青|发课|余杰|辛子陵|茅于轼|铁流|liu.*xiaobo|xiaobo.*liu|刘霞|我没有敌人|我的最后陈述|零八.*宪章|宪章.*零八|08.*宪章|宪章.*08|八宪章|8宪章|零八.*县长|县长.*零八|08县长|淋巴县长|谭作人|高智晟|冯正虎|丁子霖|唯色|焦国标|何清涟|方励之|严家其|柴玲|乌尔凯西|封从德|炳章|苏绍智|陈一谘|韩东方|辛灏年|曹长青|陈破空|盘古乐队|盛雪|伍凡|魏京生|司徒华|黎安友|张宏堡|地下教会|冤民大同盟|达赖|藏独|freetibet|雪山狮子|西藏流亡政府|青天白日旗|民进党|洪哲胜|独立台湾会|台湾政论区|台湾自由联盟|台湾建国运动组织|台湾.*独立联盟|独立联盟.*台湾|新疆.*独立|独立.*新疆|东土耳其斯坦|east.*turkistan|世维会|迪里夏提|明报|纽约时报|美国之音|自由亚洲电台|记者无疆界|维基解密.*中国|中国.*维基解密|世界经济导报|中国数字时代|蟹农场|中国.*禁闻|禁闻.*中国|阅后即焚|阿波罗网|阿波罗新闻|大参考|bignews|多维|看中国|博讯|boxun|peacehall|hrichina|独立中文笔会|华夏文摘|开放杂志|大家论坛|华夏论坛|中国|坛|木子论坛|争鸣论坛|大中华论坛|反腐败论坛|新观察论坛|新华通论坛|正义党论坛|热站政论网|华通时事论坛|华语世界论坛|华岳时事论坛|两岸三地论坛|南大自由论坛|人民之声论坛|万维读者论坛|你说我说论坛|东西南北论坛|东南西北论谈|知情者|红太阳的陨落|和谐拯救危机|血房|一个孤僻的人|河殇|天葬|黄祸|我的奋斗|历史的伤口|改革年代政治斗争|改革年代的政治斗争|关键时刻|超越红墙|梦萦未名湖|一寸山河一寸血|北国之春|北京之春|中国之春|东方红时空|婴儿汤|代开.*发票|发票.*代开|钓鱼岛|女保镖|chinese people eating babies|洗脑|网特|内斗|党魁|文字狱|一党专政|一党独裁|新闻封锁|^freechina|反社会|维权人士|维权律师|异见人士|异议人士|高瞻|地下刊物|tits|boobs|色情|花花公子|中功|法轮|falun|明慧|minghui|退党|三退|九评|nine commentaries|洪吟|神韵艺术|神韵晚会|人民报|renminbao|纪元|^dajiyuan|epochtimes|新唐人|ntdtv|ndtv|新生网|^xinsheng|正见网|zhengjian|追查国际|真善忍|法会|正念|经文|天灭|天怒|迫害|酷刑|邪恶|讲真相|马三家|善恶有报|活摘器官|群体灭绝|防火长城|great.*firewall|firewall.*great|gfw.*什么|什么.*gfw|国家防火墙|翻墙|代理|方滨兴|vpn.*免费|免费.*vpn|vpn.*下载|下载.*vpn|vpn.*世纪|世纪.*vpn|hotspot.*shield|shield.*hotspot|goagent|ultrasurf|动态网|花园网|纳米比亚|freegate|自由门|自由門|无界|無界|动网通|dongtaiwang/ig,
				// 强制屏蔽关键词
				"replacement": /父|母|夫|妻|女儿|儿子|孙子|孙女|女婿|娘|爹|爸|妈|爷|奶|哥|弟|兄|姐|妹|鸡|鸭|狗|猪|gay|mother|mom|father|dad|sister|brother|son|daughter|dog|pig/ig,
				// 替换关键词
				"ignore": /\~|\!|\@|\#|\$|\%|\^|\&|\*|\(|\)|_|\||\+|\-|\=|\{|\}|\[|\]|\;|\'|\:|\"|\<|\>|\?|\/|\.|\,|\！|\＃|\￥|\…|\（|\）|\—|\、|\【|\】|\｛|\｝|\；|\：|\‘|\’|\“|\”|\《|\》|\＼|\，|\。|\、|\？|\ |\　/ig
					// 忽略词
			},
			"blockusers": [ // 封禁用户
				"test"
			],
			"maxlength": 100, // 队列最大长度
			"textlength": 1000, // 弹幕最大长度
			"image": {
				"regex": /\[IMG WIDTH=(\d+)\](.+?)\[\/IMG\]/ig, // 图片弹幕
				"lifetime": 300 // 每个图片给每条弹幕增加的时间
			},
			"permissions": { // 普通用户允许的弹幕权限
				"send": true, // 弹幕开关；关闭后无论普通用户还是高级权限都完全禁止弹幕。
				"style": false, // 弹幕样式开关
				"color": false, // 颜色开关
				"textStyle": false, // CSS开关
				"height": false, // 高度开关
				"lifeTime": false, // 显示时间开关
				"sourceCode": false, // 自定义高级JavaScript弹幕开关
			}
		},
		"unlimited": {
			"display": "无限房间",
			"table": "room_unlimited", // 数据表
			"connectpassword": "", // 客户端连接密码
			"managepassword": "", // 管理密码
			"advancedpassword": "", // 高级弹幕密码
			"keyword": {
				"block": /^$/,
				// 强制屏蔽关键词
				"replacement": /^$/,
				// 替换关键词
				"ignore": /^$/
					// 忽略词
			},
			"blockusers": [ // 封禁用户
			],
			"maxlength": 1000, // 队列最大长度
			"textlength": 10000, // 弹幕最大长度
			"image": {
				"regex": /\[IMG WIDTH=(\d+)\](.+?)\[\/IMG\]/ig, // 图片弹幕
				"lifetime": 300 // 每个图片给每条弹幕增加的时间
			},
			"permissions": { // 普通用户允许的弹幕权限
				"send": true, // 弹幕开关；关闭后无论普通用户还是高级权限都完全禁止弹幕。
				"style": true, // 弹幕样式开关
				"color": true, // 颜色开关
				"textStyle": true, // CSS开关
				"height": true, // 高度开关
				"lifeTime": true, // 显示时间开关
				"sourceCode": true, // 自定义高级JavaScript弹幕开关
			}
		}
	},
	"database": {
		"type": "mysql", // 数据库类型（mysql / mongo / csv / none）
		"server": "127.0.0.1", // 数据库地址（mysql / mongo）
		"username": "root", // 数据库用户名（mysql / mongo）
		"password": "123456", // 数据库密码（mysql / mongo）
		"port": "3306", // 数据库端口（mysql / mongo）
		"db": "danmu", // 数据库（mysql / mongo）
		"retry": 10, // 24小时允许断线重连最大次数，超过则自动退出程序。24小时以第一次断线时间计。（mysql）
		"timeout": 1000, // 数据库重连延时及Ping（mysql）
		"savedir": "./", // 指定文件保存位置（csv）
	},
	"websocket": {
		"interval": 10, // 弹幕发送间隔
		"singlesize": 5 // 每次弹幕发送数量
	},
	"http": {
		"port": 3000, // 服务器端口
		"headers": { // HTTP头
			//"Access-Control-Allow-Origin": "*",
			//"Access-Control-Allow-Methods": "POST"
		},
		"sessionKey": "hey"
	},
	"cache": {
		"type": "memcached", // 缓存类型，支持memcached和aliyun。后者需要npm install aliyun-sdk
		"host": "127.0.0.1:11211", // 缓存服务器地址，可用socket
		"auth": false, // 是否打开身份验证
		"authUser": "", // 身份验证账号
		"authPassword": "" // 身份验证密码
	},
	"ext": {
		/*"weibo": {
			"clientID": '', // App ID
			"clientSecret": '', // App Secret
			"callbackURL": 'http://test.zsxsoft.com:3000/auth/sina/callback', // 这里填写的是 网站地址/auth/sina/callback
			"requireState": true // 是否打开CSRF防御
		},*/
		"autoban": {
			"block": 3, // 被拦截超过一定数字自动封号
		}
	}
}
